docs/mathematical-methods-for-signals-and-systems/15-orthonormality.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-01 Sat 11:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Orthonormality</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href=" ./style.css" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="classes.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a>
</div>
<div id="content" class="content">
<h1 class="title">Orthonormality</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org76e46ca">1. Angle between vectors</a></li>
<li><a href="#org18ead47">2. Orthornormal</a></li>
</ul>
</div>
</div>
<p>
If we write $$||x||<sup>2</sup> + ||y||<sup>2</sup> = ||x+y||<sup>2</sup>$ (\(<x,y> = 0\)), that means we get a right triangle where the short ends are \(x\) and \(y\), in other words they are orthogonal (\(x \perp y\)). Thus, then norm has a sense of angle "baked in" as we have leared in earlier classes.
</p>

<div id="outline-container-org76e46ca" class="outline-2">
<h2 id="org76e46ca"><span class="section-number-2">1.</span> Angle between vectors</h2>
<div class="outline-text-2" id="text-1">
\begin{equation*}
\begin{array}{c}
cos(\theta) \frac{<x,y>}{||x||_2 ||y||_2} \\
-1 \le \frac{<x,y>}{||x||_2 ||y||_2} \le 1
\end{array}
\end{equation*}

<p>
When this fraction is \(0\), that means that the vectors are orthogonal.
</p>
</div>
</div>

<div id="outline-container-org18ead47" class="outline-2">
<h2 id="org18ead47"><span class="section-number-2">2.</span> Orthornormal</h2>
<div class="outline-text-2" id="text-2">
<p>
Building directly off the orthogonality idea, the orthonormal set is the set of orthogonal vectors divided by the norm. After taking the norm, we can use this set of vectors to form a new basis.
</p>

<div class="definition" id="orgfe06a59">
<p>
A set of vectors \(\{p_i\}\) for \(i = 1,...,m\) are orthonormal if \(<p_i,p_j> = \delta_{i,j}\) for pairs \(i\) and \(j\). Where \(\delta_{i,j}\) is the <a href="https://en.wikipedia.org/wiki/Kronecker_delta">Kronecker delta</a>.
</p>

</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-04-01 Sat 11:11</p>
</div>
</body>
</html>
